12/data/attachments/d9ff1c6480c31ac8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_65f8c294-a64a-4bc2-a466-5d184e4ae4e4</nif:username>
            <nif:friendToBeAdded>Karen_cause_Friend_16073_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>